%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% Part 1 Δημιουργήστε το σήμα Eirini Donti
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
close all % κλείστε όλες τις γραφικές παραστάσεις
clear all % καθαρίστε τον χώρο εργασίας
clc       % καθαρίστε το παράθυρο εντολών
Fs=2000;  % συχνότητα δειγματοληψίας 2000 Hz
Ts=1/Fs;  % περίοδος δειγματοληψίας
L=2000;   % μήκος σήματος (αριθμός δειγμάτων)
T=L*Ts;   % διάρκεια σήματος
t=0:Ts:(L-1)*Ts;               % χρονικές στιγμές υπολογισμού το σήματος

x=sin(2*pi*100*t)...           % ημιτονικό σήμα συχνότητας 100 Hz
+ 0.3*sin(2*pi*150*(t-2))...   % συνιστώσα 150 Hz
+ sin(2*pi*200*t);             % συνιστώσα 200 Hz

% Σχεδιάστε το σήμα στο πεδίο του χρόνου

figure(1)                      % άνοιγμα παραθύρου για γραφική παράσταση
plot(t,x)                      % γραφική παράσταση του σήματος
title('Time domain plot of x - Eirini Donti') % τίτλος γραφικής παράστασης
xlabel('t (sec)')              % λεζάντα στον άξονα x
ylabel('Amplitude')            % λεζάντα στον άξονα y
pause                          % αναμονή, πιέστε ένα πλήκτρο για να συνεχίσετε
axis([0 0.3 -2 2])             % εμφάνιση του σήματος από 0 έως 0.3 sec και
                               % κλίμακα από -2 έως 2
pause                          % αναμονή, πιέστε ένα πλήκτρο για να συνεχίσετε

% Υπολογίστε τον διακριτό μετασχηματισμό Fourier

N = 2^nextpow2(L);             % μήκος μετασχηματισμού Fourier.
                               % η nextpow2 βρίσκει τον εκθέτη της δύναμης του 2 που
                               % είναι μεγαλύτερη ή ίση από το όρισμα L
                               % εναλλακτικά, =ceil(log2(L))
Fo= Fs/N;                      % ανάλυση συχνότητας
f=(0:N-1)*Fo;                  % διάνυσμα συχνοτήτων
X= fft(x,N);                   % αριθμητικός υπολογισμός του διακριτού μετασχηματισμού
                               % Fourier (DFT) για Ν σημεία

% Σχεδιάστε το σήμα στο πεδίο συχνότητας
% Αφού το σήμα είναι πραγματικό μπορείτε
% να σχεδιάσετε μόνο τις θετικές συχνότητες

figure(2)                                          % άνοιγμα παραθύρου για γραφική παράσταση
plot(f(1:(length(f))),abs(X(1:(length(X)))))       % γραφική παράσταση των θετικών συχνοτήτων
title('Frequency domain plot of x - Eirini Donti') % τίτλος γραφικής παράστασης
xlabel('f (Hz)')                                   % λεζάντα στον άξονα x
ylabel('Amplitude')                                % λεζάντα στον άξονα y
pause                                              % αναμονή για να δείτε το σχήμα
                                                   % πιέστε ένα πλήκτρο για να συνεχίσετε

% για τη γραφική παράσταση του αμφίπλευρου φάσματος
% πρέπει να χρησιμοποιήσετε την fftshift ώστε ο όρος για
% τη συχνότητα μηδέν να μετακινηθεί στην αρχή των αξόνων
% δείτε help fftshift για περισσότερες λεπτομέρειες

figure(3)                                        % άνοιγμα παραθύρου για γραφική παράσταση
f=f-Fs/2;                                        % ολίσθηση συχνοτήτων προς τα αριστερά κατά –Fs/2
X=fftshift(X);                                   % ολίσθηση της μηδενικής συχνότητας στο κέντρο
                                                 % του φάσματος
                                                 % (ακολουθούν πολλές εντολές σε μια γραμμή)
plot(f,abs(X));title('Two sided spectrum of x - Eirini Donti'); xlabel('f (Hz)');
ylabel('Amplitude')
pause                                            % αναμονή, πιέστε ένα πλήκτρο για να συνεχίσετε

% Υπολογίστε την ισχύ

power=X.*conj(X)/N/L;                            % υπολογισμός πυκνότητας ισχύος
figure(4)                                        % άνοιγμα παραθύρου για γραφική παράσταση
plot(f,power)                                    % ισχύς ανά συνιστώσα συχνότητα
xlabel('Frequency (Hz)')                         % λεζάντα στον άξονα x
ylabel('Power')                                  % λεζάντα στον άξονα y
title('{\bf Periodogram - Eirini Donti}')        % τίτλος διαγράμματος με παχιά γράμματα
pause

disp('Part2')
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% Part 2 Προσθέστε θόρυβο στο σήμα
n=0.5*randn(size(x));            % Συμπληρώστε τον κώδικα για τη δημιουργία του σήματος θορύβου n με τη
                                 % βοήθεια της συνάρτησης randn.
                                 % Το διάνυσμα θορύβου n θα πρέπει να είναι του ίδιου μεγέθους με αυτό της
figure(5)                        % ημιτονοειδούς κυματομορφής x του πρώτου μέρους. Δείτε help size.
plot(t,n)                        % Σχεδιάστε το σήμα θορύβου στο διάστημα από 0 έως 0.3 sec και κλίμακα
axis([0 0.3 -2 2])               % από -2 έως 2
xlabel('Time (t)')               
ylabel('Noise')
title('Noise Signal - Eirini Donti')
pause
Fx=fft(n,N);                     % Υπολογίστε το περιοδόγραμμα του n και σχεδιάστε την πυκνότητα φάσματος
power=Fx.*conj(Fx)/Fs/L;         % ισχύος του σήματος θορύβου.
figure(6) 
plot(f,power)
xlabel('Frequency (Hz)')
ylabel('Power')
title('{\bf Periodogram - Eirini Donti}')
pause
s=x+n;                           % Προσθέστε το σήμα θορύβου και το x για να λάβετε το σήμα με θόρυβο s.
figure(7)
plot(t,s)                        % Σχεδιάσατε το σήμα με θόρυβο s στο πεδίο του χρόνου στην περιοχή 0 έως
xlabel('Time (t)')               % 0.2 sec και κλίμακα από -2 έως 2 καθώς και το αμφίπλευρο φάσμα του
ylabel('Signal')
title('Signal with noise - Eirini Donti')
axis([0 0.2 -2 2])  
pause
%f=f-Fs/2;
S=fft(s,N);
S=fftshift(S); 
figure(8)
plot(f,abs(S)); title('Two sided spectrum of s - Eirini Donti'); xlabel('f (Hz)');
ylabel('Amplitude')
pause 
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

disp('Part3')
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% Part 3. Πολλαπλασιασμός σημάτων
signal=1*sin(2*pi*700*t)         % Συμπληρώστε τον κώδικα δημιουργίας ενός ημιτονοειδούς σήματος συχνότητας
signal = s.*signal               % 700 Hz και πολλαπλασιάστε με το προηγούμενο σήμα s.
                                 % Τα δύο σήματα θα πρέπει να είναι του ίδιου μεγέθους και να χρησιμοποιηθεί
figure(9)                        % ο τελεστής '.*' για ανά στοιχείο πολλαπλασιασμό.
plot(t,signal)                   % Σχεδιάστε το αποτέλεσμα στο πεδίο του χρόνου στην περιοχή 0 έως 0.2 sec
axis([0 0.2 -2 2])               % και κλίμακα από -2 έως 2 καθώς και στο πεδίο της συχνότητας
xlabel('Time (t)')               % χρησιμοποιώντας τη συνάρτηση fftshift.
ylabel('Signal')
title('Signal - Eirini Donti') 
pause                            
%f=f-Fs/2;                        
Signal=fft(signal,N);
Signal=fftshift(Signal);
figure(10)
plot(f,abs(Signal)); title('Two sided spectrum of signal - Eirini Donti'); xlabel('f (Hz)');
ylabel('Amplitude')
pause
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
